package main

func main() {
	//for [инициализация счетчика]; [условие]; [изменение счетчика]{
	//// действия
	//}

	//sum := 0
	// 1) инициализации счётчика: i := 1. то есть это инициализация переменной
	// 2) второе - это условие. До тех пор, пока условие возвращает true (то есть пока условие - истина), цикл будет выполняться дальше
	// 3) третья часть - увеличиваем i на 1 (увеличиваем счётчик, который на следующей итерации будет проверяться на истину или ложь)
	//for i := 1; i < 10; i++ {
	//	sum += i
	//}
	//fmt.Println(sum)

	// можно так:
	//var i = 1
	//for ; i < 10; i++{
	//	fmt.Println(i * i)
	//}

	// or this shit
	//var i = 1
	//for ; i < 10;{
	//	fmt.Println(i * i)
	//	i++
	//}

	// or like there
	//var i = 1
	//for i < 10{
	//	fmt.Println(i * i)
	//	i++
	//}

	// infinity for loop
	//for {
	//
	//}
}
